city = """
Ходосівка - маленьке містечко, розташоване в Україні. Це місце з багатою історією та культурою. 
Воно відоме своїми живописними краєвидами та природою. 
У Ходосівці зберігаються старовинні церкви та пам'ятки, які привертають увагу туристів. 
Місто відоме своїми традиціями та святами, які зберігаються від покоління до покоління. 
Жителі цього міста гостинні та доброзичливі. 
Вони пишаються своїм містом і завжди раді показати його гостям. 
Ходосівка - місце, де можна 
відчути дух минулого та 
насолодитися спокоєм і красою навколишньої природи.
"""

unicode = "\U0001F30C"
print(city + unicode)
